# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
#! МАТРИЦЫ---------------------------------------------------------------------
# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
# ! Перебор элементов матрицы
matrix = [[277, -930, 11, 0],
          [9, 43, 6, 87],
          [4456, 8, 290, 7]]

# !Выравниваине через f-строки
for i in range(len(matrix)):
    for j in range(len(matrix[i])):
        print(f'{matrix[i][j]:#>6}', end=' ')
    print()

# !Выравниваине через метод ljust / rjust
for i in range(len(matrix)):
    for j in range(len(matrix[i])):
        print(str(matrix[i][j]).rjust(6, '#'), end=' ')
    print()

# ────────────────────────────────────────────────────────────────────

# !Пример разворота матрицы
mtx = [[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]]

for i in range(3):
    for j in range(3):
        # по сути начинает с последнего элемента
        print(mtx[3-i-1][3-j-1], end=' ')
    print()

# эквивалент предыдушему фрагменту
for i in range(2, -1, -1):
    for j in range(2, -1, -1):
        print(mtx[i][j], end=' ')
    print()

# ────────────────────────────────────────────────────────────────────

# !Главная и побочная диагонали квадратной матрицы
# создаем квадратную матрицу размером n×n
n = int(input('Введите размерность матрицы: '))
matrix = [[0]*n for _ in range(n)]

# заполняем главную диагональ единицами, а побочную двойками
for i in range(n):
    matrix[i][i] = 1  # главная (сверху слева к низу справа)
    matrix[i][n-i-1] = 2  # побочная (свеху справа к низу слева)

for r in range(n):  # выводим матрицу
    for c in range(n):
        print(matrix[r][c], end=' ')
    print()

# ────────────────────────────────────────────────────────────────────

# !Заполнение выше и ниже главной диагонали и побочной диагонали
n = int(input('Введите размерность матрицы: '))
matrix = [[0] * n for _ in range(n)]

for i in range(n):
    for j in range(n):
        if i == j:  # !главная диагональ
            matrix[i][j] = 1
        elif i < j:  # выше главной диагонали
            matrix[i][j] = 2
        elif i > j:  # ниже главной диагонали
            matrix[i][j] = 3
        elif i + j == n - 1:  # !побочная диагональ
            matrix[i][j] = 11
        elif i + j < n - 1:  # выше побочной диагонали
            matrix[i][j] = 33
        elif i + j > n - 1:  # ниже побочной диагонали
            matrix[i][j] = 22

for i in range(n):
    for j in range(n):
        print(f'{matrix[i][j]:<2}', end=' ')
    print()

# ────────────────────────────────────────────────────────────────────

# !Заполнение элементов квадратной матрицы по четвертям
n = int(input('Введите размерность матрицы: '))
matrix = [[0] * n for _ in range(n)]

for i in range(n):
    for j in range(n):
        if i < j and i + j > n - 1:  # первая четверть
            matrix[i][j] = 1
        elif i < j and i + j < n - 1:  # вторая четверть
            matrix[i][j] = 2
        elif i > j and i + j < n - 1:  # третья четверть
            matrix[i][j] = 3
        elif i > j and i + j > n - 1:  # четвертая четверть
            matrix[i][j] = 4
        matrix[i][i] = 'm'  # заполняем главную диагональ
        matrix[i][n-i-1] = 's'  # заполняем побочную диагональ

for i in range(n):  # вывод результата
    for j in range(n):
        print(f'{matrix[i][j]:<2}', end=' ')
    print()

'''
Или так:
for i in range(n):
    for j in range(n):
        if i < j and i > 6-1-j:
            matrix[i][j] = '1'
        elif i < j and i < 6-1-j:
            matrix[i][j] = '2'
        elif i > j and i < 6-1-j:
            matrix[i][j] = '3'
        elif i > j and i > 6-1-j:
            matrix[i][j] = '4'
'''
# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
#! СЛОВАРИ---------------------------------------------------------------------
# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────

#! Создание словаря с помощью функции dict()
info = dict(name='Timur', age=28, job='Teacher')
print(info)  # {'name': 'Timur', 'age': 28, 'job': 'Teacher'}

# ────────────────────────────────────────────────────────────────────

#! Создание словаря на основании списков и кортежей
info_list = [('name', 'Timur'), ('age', 28), ('job', 'Teacher')]
info_dict = dict(info_list)
print(info_dict)  # {'name': 'Timur', 'age': 28, 'job': 'Teacher'}

# ────────────────────────────────────────────────────────────────────

#! Для создания словаря у которого разные ключи и одинаковые значения, используют
#! метод fromkeys()
dict1 = dict.fromkeys(['name', 'age', 'job'], 'exemple value')
print(dict1)  # {'name': 'exemple', 'age': 'exemple', 'job': 'exemple'}

#! Если методу не передать второй параметр, то присвоится значине None
dict2 = dict.fromkeys(['name', 'age', 'job'])
print(dict2)  # {'name': None, 'age': None, 'job': None}

# ────────────────────────────────────────────────────────────────────

#! Создание пустого словаря
exemple_dict = {}
exemple_dict = dict()

# ────────────────────────────────────────────────────────────────────

#! Методы словарей
exemple_dict.keys()  # возвращает список ключей словаря
exemple_dict.values()  # возвращает список значений словаря
exemple_dict.items()  # возвращает словарные пары ключ: значение, как кортежи

info = {
    'name': 'Kirill',
    'age': 25
}

#! Не меняет словарь
get_key = info.get('job', 'SberTech')
print(get_key)
print(info)

#! Меняет словарь
setde_key = info.setdefault('job', 'SberTech')
print(setde_key)
print(info)

'''
Пусть задан список чисел numbers, где некоторые числа встречаются неоднократно.
Нужно узнать, сколько именно раз встречается каждое из чисел.
'''

#! Подсчет количества объкетов
numbers = list(map(int, input().split()))  # [1, 2, 3, 1, 2, 3, 4, 4, 7, 7, 1]
result = {}

for num in numbers:
    result[num] = result.get(num, 0) + 1

# или без метода .get()
for num in numbers:
    if num in result:
        result[num] += 1
    else:
        result[num] = 1

print(result)

# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
#! МНОЖЕСТВА-------------------------------------------------------------------
# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
'''
Если множество X содержит n элементов, то оно имеет 2**n подмножеств,
включая пустое множество. Например, множество X = {a, b, c} содержит 3 элемента
и имеет 8 подмножеств:
{
    ∅
}
1. {∅}
2. {a}
3. {b}
4. {c}
5. {a, b}
6. {a, c}
7. {b, c}
8. {a,b,c}
'''


'''
1.  все элементы множества уникальны
2.  множества неупорядочены
3.  элементы множества должны относиться к неизменяемым типам данных
4.  хранящиеся в множестве элементы могут иметь разные типы данных
5.  Чтобы создать множество, нужно перечислить его элементы через запятую в
    фигурных скобках numbers = {2, 4, 6, 8, 10}. Создать пустое множество можно
    с помощью встроенной функции, которая называется set(), создать пустое
    множество с помощью пустых фигурных скобок нельзя, c помощью
    пустых фигурных скобок создаются словари... так сложилось исторически.
    Дело в том, что словари появились в Python раньше, чем множества
8.  индексация и срезы недоступны для множеств
9.  Операция конкатенации "+" и умножения на число "*" недоступны для множеств
'''
# ────────────────────────────────────────────────────────────────────

myset1 = {1, 2, 3, 4, 5}
myset2 = {3, 4, 6, 7, 8}

# Объединение (возвращает новое множество)
res = myset1.union(myset2)
res = myset1 | myset2
print(res)  # {1, 2, 3, 4, 5, 6, 7, 8}

# Пересечение (возвращает новое множество)
res = myset1.intersection(myset2)
res = myset1 & myset2
print(res)  # {3, 4}

# Разность (возвращает новое множество). Удаляет пересекающиеся элементы
# в первом множестве
res = myset1.difference(myset2)
res = myset1 - myset2
print(res)  # {1, 2, 5}

# Симметрическая разность (возвращает новое множество). Объединяет, удаляя
# пересекающиеся элементы
res = myset1.symmetric_difference(myset2)
res = myset1 ^ myset2
print(res)  # {1, 2, 5, 6, 7, 8}

# ────────────────────────────────────────────────────────────────────

myset1 = {1, 2, 3, 4, 5}
myset2 = {3, 4, 6, 7, 8}

# Объединение (изменяет исходное множество)
myset1.update(myset2)
myset1 |= myset2
print(myset1)

# Пересечение (изменяет исходное множество)
myset1.intersection_update(myset2)
myset1 &= myset2
print(myset1)

# Разность (изменяет исходное множество). Удаляет пересекающиеся элементы
# в первом множестве
myset1.difference_update(myset2)
myset1 -= myset2
print(myset1)

# Симметрическая разность (изменяет исходное множество). Объединяет, удаляя
# пересекающиеся элементы
myset1.symmetric_difference_update(myset2)
myset1 ^= myset2
print(myset1)

# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
#! ЧТЕНИЕ ЗАПИСЬ
# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
data = open(r'/Users/userkady/desktop/test.txt', 'r+', encoding='utf-8')

data_read = data.read()
print(data_read)
# lorem ipsum1 lorem ipsum2
# lorem ipsum3 lorem ipsum4

data_readline = data.readline()
print(data_readline)  # lorem ipsum1 lorem ipsum2

data_readlines = data.readlines()
print(data_readlines)
['lorem ipsum1 lorem ipsum2\n', 'lorem ipsum3 lorem ipsum4']

data.close()  # Закрыть файл
print(data.closed)  # Проверить открыт файл или закрыт
# ────────────────────────────────────────────────────────────────────
#! Контекстный менеджер
#! Запись данных в файлы. Методы write() и writelines()

with open(r'/Users/userkady/desktop/test.txt', 'r', encoding='utf-8') as data:
    for line in data:
        print(line.strip())
        # 1 line of the filee
        # 2 line of the file
        # 3 line of the file

with open(r'/Users/userkady/desktop/test.txt', 'a', encoding='utf-8') as data:
    data.write('\n4 line of the file')

data = open(r'/Users/userkady/desktop/test.txt', 'r', encoding='utf-8')
for line in data:
    print(line.strip())
    # 1 line of the filee
    # 2 line of the file
    # 3 line of the file
    # 4 line of the file

with open(r'/Users/userkady/desktop/test.txt', 'a', encoding='utf-8') as data:
    data.writelines(['\nДжoн Локк\n', 'Дэвид Хьюм\n', 'Эдмyнд Берк\n'])

data = open(r'/Users/userkady/desktop/test.txt', 'r', encoding='utf-8')
for line in data:
    print(line.strip())
    # 1 line of the filee
    # 2 line of the file
    # 3 line of the file
    # 4 line of the file
    # Джoн Локк
    # Дэвид Хьюм
    # Эдмyнд Берк
# ────────────────────────────────────────────────────────────────────
#! Запись в файл с помощью функции print()

with open(r'/Users/userkady/desktop/test.txt', 'a', encoding='utf-8') as data:
    print('Джoн Локк', 'Дэвид Хьюм', 'Эдмyнд Берк', sep='\n', file=data)

# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
#! ИСКЛЮЧЕНИЯ------------------------------------------------------------------
# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
# ────────────────────────────────────────────────────────────────────
try:
    # блок кода
except ТипИсключения1:
    # что делаем при исключении ТипИсключения1
except ТипИсключения2:
    # что делаем при исключении ТипИсключения2
except (ТипИсключения3, ТипИсключения4):
    # что делаем при исключении ТипИсключения3 или ТипИсключения4
...
except ТипИсключенияN:
    # что делаем при исключении ТипИсключенияN
else:
    # что делаем, если не было исключения
finally:
    # что в конце делаем при любых вариантах

try:
    raise TypeError('Бу! Испугался?')
except TypeError as e:
    print(e)
    print('Это я! TypeError')

# распространение исключений
def second():
    print("Start second")
    1 / 0
    print("Finish second")


def first():
    print("Start first")
    try:
        second()
    except ArithmeticError as a:
        print(f"Handling {a}")
    print("Finish first")


first()
