# ────────────────────────────────────────────────────────────────────
#! ОСНОВЫ ПРОГРАММИРОВАНИЯ НА PYTHON
# ────────────────────────────────────────────────────────────────────
# ! Знакомство с функциями
# !   Назначение
# !   Правила оформления
# !   Определение и вызов
# !   Пустая функция: инструкция pass
# !   Возвращаемое значение: инструкция return
# * Позиционные и именованные аргументы
# *   Позиционные аргументы
# *   Именованные аргументы
# *   Комбинация позиционных и именованных аргументов
# * Обязательные и необязательные параметры
# *   Обязательные параметры
# *   Необязательные параметры
# *   Комбинация обязательных и необязательных параметров
# * Изменяемые типы в качестве значений по умолчанию: проблема и паттерн None
# * Чистая функция
# * Переменное количество аргументов: параметры * args ** kwargs
# *   Получение позиционных аргументов в виде кортежа: параметр * args
# *   Передача аргументов в форме списка и кортежа
# *   Получение именованных аргументов в виде словаря: параметр ** kwargs
# *   Передача аргументов в форме словаря
# *   Только именованные аргументы: символ / в сигнатуре
# *   Только позиционные аргументы: символ * в сигнатуре
# *   Порядок параметров при их комбинации

"""
Аннотации типов
Строка документирования
Интроспекция: type() и isinstance()
Функции, как объекты первого порядка
Область видимости и пространство имен
Вложенные функции
Анонимная функция
Функции высшего порядка
Встроенные часто используемые функции
"""


# ────────────────────────────────────────────────────────────────────
#! ОБЪЕКТНО-ОРИЕНТИРОВАННОЕ ПРОГРАММИРОВАНИЕ НА PYTHON
# ────────────────────────────────────────────────────────────────────
# * Базовые понятия
# *   Класс
# *   Экземпляр класса (объект)
# * Атрибуты
# *   Атрибуты класса
# *   Атрибуты экземпляра
# * Методы
# *   Методы экземпляра: параметр self
# *   Инициализация экземпляра: метод __init__
#!   Моносостояние экземпляра
#!   Метод класса: @classmethod
#!   Статический метод: @staticmethod
# *   Разница между методами экземпляра, класса и статическими методами
#! Пространство имен класса и экземпляра
#! Инкапсуляция
#!   Публичные, защищённые и приватные атрибуты и методы
#!   Геттеры, сеттеры и делитеры
#!   Свойства: @property
#!   Вычисляемые атрибуты
#! Наследование

"""
Наследование
    Базовый и дочерний класс
    Переопределение методов
    Метод super()
    Множественное наследование
    Порядок разрешения методов: MRO
    Миксины
    Делегирование и композиция
Полиморфизм
    Полиморфизм через переопределение методов
    Duck typing
    Полиморфизм в Python
Абстракция
    Абстракция: интерфейс и реализация
    Абстрактные классы
    Протоколы
Магические методы
    Представление объекта: __str__ и __repr__
    Поведение объекта: __len__, __abs__, __bool__, __call__
    Арифметические операции
    Операции сравнения
    Индексация и элементы: __getitem__, __setitem__, __delitem__
    Итерация: __iter__ и __next__
    Контекстный менеджер: __enter__ и __exit__
Исключения
    Исключения в ООП
Специальные механизмы Python
    Дескрипторы
    Dataclass
    __slots__
    Enum
Продвинутые темы
    Метод __new__
    Singleton
    Класс type
    Метаклассы
    Декораторы классов
"""
# ✅ ок:
# ❌ SyntaxError:
